Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 寒冬法杖被拿在手上，那种熟悉的魔法波动流遍林立全身，低沉而又冗长的咒文吟唱声在树林间响起，随着这玄奥难明的咒文吟唱，四周的空气仿佛在刹那之间降到了冰点，感受着这强大的魔法力量，伊娜停止了哭泣，只是怔怔的望着树下的林立，就连巨网中的利维坦猩猩，也仿佛忘记了怪笑，高阶魔兽与生俱来的天性告诉它，自己已经陷入了危险当中。
en_us: Holding the Winter Staff in his hand, Lin Li felt a familiar rush of magical wave all over his body. A low yet lengthy recitation of spell sounded among the trees. The surrounding air seemed to drop to freezing point in an instant with the abstruse and mysterious recitation. Ina stopped her crying and stared down blankly at Lin Li as she took in the powerful magical force. Even the Leviathan Gorilla, which was in the giant net, had forgotten its weird cackles. The inborn instinct of a high-level magical beast had told that it was in danger.

source: 寒流所过之处，只见白茫茫的一片，在霜结术带起的严寒之下，范围所及的每一根藤条都被凝成了冰块。范围并不太广，大概只有十几米的地方，但这对林立来说，却已经足够了。
en_us: Wherever the cold current passed, a vast expanse of white could be seen. Under the frigid cold brought on by the Frost Spell, every rattan in the range was chilled to ice. The range wasn't wide, perhaps only a few dozen meters, but it was enough for Lin Li.

source: 对于一个魔法师来说，大概再也没有比魔力更加珍贵的东西了。
en_us: For a mage, nothing was much more valuable than the mana.

source: 对于柳长老，江逸并没有感情，不过人不是他杀的，却因他而死，他这几日时间很是不安和内疚。还半夜去了柳长老的坟墓前磕了几个头，洒了两杯黄酒。
en_us: Towards Elder Liu, Jiang Yi had no feelings at all. However, even though he did not directly murder the man, he had spent the past few days feeling uneasy and guilty. He had even gone to Elder Liu's grave in the middle of the night and kowtowed several times as well as poured two cups of yellow wine in front of the grave.

source: 对于身家百万金币的林立来说，一件皮甲一把武器又算得了什么，简简单单几句话，就把这事情给定了下来。
en_us: A leather armor and a weapon were nothing to the millionaire Lin Li. With only a few words, the plan was settled.

source: 对于这个封印他是熟悉得不能再熟了，自从达到铸鼎境一重能内视后，他最少内视了这个龙形封印几万遍，他清清楚楚记得这龙形封印一共由一万零八千枚符文组成，而此刻少了一枚……
en_us: He was very familiar was this seal. Ever since he'd reached the first stage of the Cast Tripod Realm and could observe his inner conditions, he had observed this dragon-shaped seal for at least several tens of thousands of times. He remembered clearly that this dragon-shaped seal was made of a total of eighteen thousand runic patterns. At that moment, one of them was missing...

source: 对于这件事，林立倒是一点也不着急。
en_us: For that, Lin Li had more than enough patience.

source: 对于高级附魔师来说，稳定性永远排在第一位。
en_us: For a high-level magical enchanter, stability would always be the first priority.

source: 对山洞里那只狮蝎，林立依旧耿耿于怀。
en_us: Lin Li was still brooding over the encounter with the Manticore in the cave.

source: 对方吃痛，倒吸一口冷气，满脸惊愕，下意识的想缩回手掌，但江逸那容他这么轻松退走，右手立即化手刀为爪，运转“缠丝手”抓住他的手臂，身子也粘了上去，大喊一声：“双龙夺珠”左手两指如箭般朝对方双眼刺去！
en_us: His opponent endured his pain, taking in a mouthful of cold air. With a face filled with shock and horror, he instinctively tried to withdraw his palms—yet Jiang Yi would not let him retreat so easily. Creating another knife-hand strike pose with his right hand and using them like claws, he circulated his Silk Hands technique and grabbed his opponent's arm. Pulling his entire body forward, he shouted, "Twin-Dragon Stealing Pearl!" Two fingers stabbed forward towards his opponent's eyes like arrows.

source: 对方注意力被江逸左手双指吸引，此刻内心暴怒，心思絮乱，哪料到江逸真正的杀招是膝盖？直到下身被猛然一顶，一股撕心裂肺的剧痛传来才幡然醒悟。
en_us: Jiang Yi’s opponent was distracted by the two fingers on Jiang Yi's left hand and had much intense fury in his heart and confusion in his mind. How could he have possibly predicted that the true killer move would actually come from Jiang Yi’s knees? It was only until his lower body was suddenly struck, and when he felt an intensely acute pain radiate through his body that he suddenly realized what had happened.

source: 对方被他的大喊声吸引了注意力，没有再去理会江小奴，冷笑一声，手掌一荡，朝他双手扫来！
en_us: His opponent was indeed distracted by his loud shout and no longer had his attention on Xiao Nu. Instead, he scoffed coldly before swinging his palms in a sweeping movement towards Jiang Yi's hands!

source: 对方铁拳破空而来，缺乏心理准备的江逸只顾着躲避，却没留神地面沟壑不平，于是在急退过程中一下踩空失去身形，待到回过神来时，对方的拳头已经近在眼前。
en_us: Jiang Bao’s iron fist flew through the air. Jiang Yi, unprepared to defend against such an attack, was focused entirely on avoiding the incoming attack. As a result, he was not attentive enough to see the uneven ditch in front of him and, in his haste to avoid the attack, he lost his balance stepping into the little hole in the ground and fell down. By the time he regained his senses, the fists of his opponent had already closed in on him.

source: 对热心魔法师来说，林立就是一切罪恶的根源，只要除掉他，自己就能顺利的和伊娜在一起。
en_us: For the zealous mage, Lin Li was the root of all evil. As long as he got rid of him, he could be together with Ina.

source: 对这三十瓶奥法药剂势在必得的梅林家族，甚至不惜处理了几处位于加洛斯城中心的房产，为的就是能在竞争中多一点筹码，毕竟葛瑞安那老家伙已经说了，这一次加洛斯魔法公会只认钱，谁出的价格最高，谁就最有机会，交情什么的，等把东西卖完了再谈！
en_us: The Merlin Family, who was determined to acquire these 30 bottles of Arcane Magic Potion, even disposed of several properties in the heart of Jarrosus City in order to gain more bargaining chips in the competition. After all, old Gerian had said that this time, the Guild of Magic would only recognize money. Whoever gave the highest price would have the best opportunity, and friendship or whatnot would have to wait after the items were sold!

source: 对这两个贱人来说，分赃过程无疑是充满乐趣的。
en_us: To these jerks, the dividing process was undoubtedly filled with joy and pleasure.

source: 对这么个惫赖家伙，林立还真不好把它怎么样。
en_us: Lin Li was rendered powerless facing a rascal like this.

source: 对面站立的翊小姐可不管那么多，双腿一个箭步朝江逸冲来，两个拳头如暴风雨般砸来。
en_us: Young Mistress Yi, who was standing opposite him, did not care as much, as she rushed towards Jiang Yi with both her legs moving as fast as arrows and both her fists smashing forward with a momentum like a sudden thunderstorm.

source: 对魔法元素的微妙控制，对魔力的精确分配，各种魔法的灵活运用，种种种种，让林立大开眼界之余，更是让他接触到了一个以前从未想象过的世界。
en_us: The subtle control of magical elements, the precise distribution of mana, and the flexible use of various kinds of magic spells, et cetera, et cetera, not only opened Lin Li's eyes, but also exposed him to a world he had never imagined before.

source: 封印仅仅刚开始破解，江水决的修炼速度竟提升了两倍，尽管还是很慢很慢，但他已经看到了一缕曙光，一道希望之门……
en_us: Even though he had only just started breaking the seal, his refining speed with the Jiang Water Art had actually increased by two times. Even though it was still much too slow, he was now able to see a thread of light through a door of hope...

source: 将东西塞到林立手上，伊娜已是羞得耳根通红，不等林立发问，这位长腿美女就象一只受惊的小白兔般逃回了冒险者公会。
en_us: After passing the item to Lin Li, Ina’s ears had turned red with embarrassment. Without waiting for Lin Li to respond, the long-legged beauty fled back into the Adventurers Guild like a frightened white rabbit.

source: 将安眠水晶还给安度因之后，林立也隐隐有些心动：“这东西，是在什么地方找到的？”
en_us: After returning the Hypnotic Crystal to Andoine, Lin Li had a secret motive. "Where di you find this?"

source: 将所有材料收进背包，林立正打算下线换号，用猎人来跟围观群众好好谈谈时，一阵尖锐的警报声却忽然响起。
en_us: After putting all the materials in his bag, Lin Li had planned to switch to his hunter account for a good talk with the onlookers when all of a sudden a sharp siren sounded.

source: 将珍贵程度丝毫不比强能水晶逊色的唤醒药剂随手塞进葛瑞安手中也就罢了，这葛瑞安一瓶才刚刚喝完，人家马上又塞了一瓶过去，理由竟是“看你打得精彩”……珍贵无比的唤醒药水到了他嘴里，就好象塞过去的是一根胡萝卜一样……
en_us: It was enough to stuff the Awakening Potion which was no less precious than the Strong Energy Crystal into the hands of Gerian. But Gerian had just finished a bottle, and he immediately stuffed him another one based "on account of how exciting you fought"... The most precious Awakening Potion, when came out of his mouth, was like a carrot that was being stuffed into the hands...

source: 小半个时辰之后，他安全抵达了武殿，在半路他运转了一丝元力在耳朵内，一路也都走小巷，确定没人跟踪他。
en_us: He reached the Martial Arts Hall safely in under an hour, with the help of the wisp of black essence force he transferred to his ears halfway; in addition, he had deliberately picked the small alleyways on his way here, to ensure there was no one tailing him.

source: 小半个时辰后……
en_us: One short hour later…

source: 小半个时辰后。
en_us: Nearly an hour later.

source: 小半柱香时间之后，翊小姐气喘吁吁的停了下来，浑身大汗淋漓，本来就紧身的红色武士袍更是完全贴住她的玲珑娇躯上，将她完美的曲线展露得淋漓尽致。
en_us: After approximately three minutes, Young Mistress Yi stopped attacking as she panted breathlessly. With her body sweating profusely, the red-colored martial artist robes, already body-hugging to begin with, stuck even more to her delicate and exquisite figure, revealing her perfect bodily curves in vivid detail and brilliance.

source: 小半瓶毁灭之龙血液倒进烧杯，刹时间便和星辰沙融合到了一起，若是看得仔细一些的话，甚至还能看见一道道细细的蓝丝在深红之间挣扎游动。
en_us: Half a vial of the dragon's blood was poured into the beaker. It instantly merged with the star sand. If looked at from up close, one could even see thin blue threads swimming in between the crimson.

source: 小奴傻兮兮的，就算被人卖了还要给人数钱，江逸从小就聪颖，自然一琢磨就明白了。他长长的吐出一口气，脸色变得狰狞起来，咬牙切齿的沉吼道：“好，好你个风月楼，竟敢如此坑害小奴？迟早有一天，小爷会把你们风月楼全部砸得稀巴烂的……”
en_us: count his profit. Jiang Yi was intelligent and alert since young—as such he clearly understood the whole incident after mulling over it for just a short moment. He released a long sigh and gave a malevolent look. Gritting his teeth, he swore in a low voice, "Alright, you're so great, people of Fengyue Brothel. How dare you try to trick and harm Xiaonu to that extent? One of these days, this master will destroy you and your building and turn you into shreds..."

source: 小奴正在院子内洗衣物，听到脚步声回头一望，两个大眼睛立即笑成了月牙儿，起身朝江逸走来。
en_us: Xiaonu was washing laundry in the yard when she heard footsteps and turned her head. She beamed immediately, her large eyes forming lovely crescents as she smiled and got up to greet Jiang Yi.

source: 小奴，全名叫江小奴。
en_us: Her full name was Jiang Xiaonu.

source: 小小的一个缺口，在林立不断射出的风刃中，正变得越来越大。
en_us: The tiny hole grew in size as Lin Li continued to deliver the wind blades.

source: 小心的将点金棒放进无尽风暴之戒，林立已开始憧憬起其他高级附魔来，一个低级抗魔属性就这么变态，那巨龙之力永恒智慧之流，还不得翻上天去？
en_us: Lin Li meticulously put away the gold rod into the Ring of Endless Storm and began to envision other high-level magical enchantment. A low-level magic resistance attribute could be this sick; then wouldn't the Dragon's Clout and Flow of Eternal Wisdom send people to heaven?

source: 小梅林只觉得心在流血，他手上一共就八十几万金币，若是照鲁本这疯子的抬价速度，怕是只要两轮，自己就会被彻底踢出奥法药剂的竞争。
en_us: Little Merlin felt his heart bleeding. He only had 800,000 gold coins with him. If he went with that lunatic Reuben's increment speed, it would only take two rounds for him to be kicked out of the contest for the Arcane Magic Potion.

source: 小江逸的武学悟性和身体资质居然一个在天，一个在地？这让当时江家所有人都大跌眼镜！
en_us: How could little Jiang Yi’s raw talent in martial arts and actual prowess be worlds apart? Everyone in the Jiang Clan was completely shocked.

source: 少女目光在江逸等人身上扫过，有些不满的说道：“杨管事，怎么没有银牌陪练？全都是铜牌的？”
en_us: The teenage girl swept a glance across Jiang Yi and the other persons around. Somewhat disgruntled, she said, "Manager Yang, why are there no silver-token-grade sparring partners? Why are they all bronze-token-grade ones?"

source: 就仿佛，这个谁也不知道姓名的人从来就没有出现在这天地间一般。
en_us: It was as if the nameless one had never stepped forth into this universe.

source: 就凭着那半瓶双足飞龙的血液，谈话内容就被这家伙扯得离题万里，他甚至都没有主动提起那半瓶双足飞龙血液，只是随便提了提七级魔兽的强大，充满求知***的金发美女就很自然的接了上去，跟着一双天蓝色的大眼睛扑闪扑闪的，带着好奇的目光望着林立问，最后为什么要去接双足飞龙的血液。
en_us: The fellow had led the conversation completely out of point with that half bottle of Wyvern's blood. He did not even mention that half bottle of Wyvern's blood first, but only casually spoke of the strength of a level-seven magical beast. The blond beauty, full of curiosity, naturally picked up the topic. A pair of sky-blue eyes blinked inquisitively at Lin Li as she asked why he had collected the Wyvern's blood at the end.

source: 就在两人说话的时候，又有三瓶奥法药剂成交，其中最低的价格也在三万以上，最高的甚至已经达到了六万金币。
en_us: As they spoke, three more bottles of Arcane Magic Potion were off the shelf. Among them, the lowest price was above 30,000, and the highest price had even reached 60,000 gold coins.

source: 就在他心头转过这个念头的时候，达芙妮又出价了：“二十万金币！”
en_us: As he turned the idea in his mind, Daphne called out another bid once more. "200,000 gold coins!"

source: 就在众人心思各异的时候，年轻首富却又说出句话来。
en_us: Everyone was in their own state of mind when the young rich man spoke again.

source: 就在众人心思各异的时候，那无数火龙带起的滔天烈焰，也终于是慢慢的散尽。
en_us: Just as everyone was in their own thoughts, the monstrous flame brought on by the countless fire dragons dissipated at last.

source: 就在利爪落下的瞬间，一记风刃撕开了空气，同时也撕开了狮蝎那柔软的腹部，狮蝎的惨叫声充满了绝望，那锋利的爪子只差一点点，就差那么一点点，就可以撕开眼前人类的身体，可就是这么一点点距离，却成了一道永远也无法跨越的鸿沟……
en_us: Just as the claws fell, a wave of wind blade tore the air apart. Then, it tore apart the soft abdomen of the Manticore as well. The cries of the Manticore were filled with despair, and the sharp claws were so close, so very close to tearing the body of the human in front of it apart. But it was this mere distance that had became a gap never to be crossed...

source: 就在愿望许下的瞬间，天空中的彩虹也随之化做无数光亮，只见那星星点点的光亮从天空中缓缓落下，就仿佛一条七色丝带般将林立包裹在内，林立可以清晰的感受到，随着自己的每一次呼吸，都仿佛有无数光亮融入体内，当最后一丝光亮也被彻底吸收之时，脑海内却随之涌出无穷无尽的知识，有锻造学的，有炼金学的，有药剂学的，也有附魔和铭文的，甚至还包括了药物知识，矿物知识等等杂学，这些知识就仿佛与生俱来就拥有一般，刚一涌出，就与原有记忆融合到了一起，林立只需要信手拈来就能轻易运用。
en_us: The instant the wish was made, the rainbow transformed into numerous beams, scattering gradually from the sky like a seven-colored ribbon wrapping Lin Li up. Lin Li could vividly feel that with every breath he took, it was as if there were countless beams infused into his body. As the last beam was absorbed, limitless knowledge gushed from his brain. Forging, alchemy, pharmaceutics, magical enchantment and inscription, and even general knowledge in medicinal, mineral and other categories. These seemed to be with him from birth, integrated with the existing memories he had, and he had them at his fingertips.

source: 就在所有人都为那三十瓶奥法药剂疯狂的时候，林立却一个人躲在药剂室里，一坐就是一上午的时间。
en_us: Just as everyone was going crazy over the thirty bottles of Arcane Magic Potion, Lin Li was hiding in the potion lab alone, sitting in for the whole morning.

source: 就在所有人都以为，翡翠高塔的失败已成定局时，林立却有些无奈的摇了摇头：“看来真是把脑子给打坏了……”
en_us: Just when everyone thought that the defeat of the Emerald Tower was a foregone conclusion, Lin Li shook his head helplessly. "Looks like his brain was really damaged..."

source: 就在林立回头之时，那暗红色的影子已是带起一股腥风，如狼似虎的扑了过来。
en_us: Just as Lin Li turned around, the dark-red shadow sprung on him along with a gush of foul wind like a horde of ferocious wolves.

source: 就在林立大伤脑筋的时候，凯文却宣布了拍卖会的高潮来临。
en_us: While Lin Li was racking his brains, Kevin announced the climax of the auction.

source: 就在林立耐心等待拍卖开始的时候，葛瑞安哎声叹气的回来了……
en_us: Just as Lin Li was patiently waiting for the auction to start, he saw Gerian return sighing in despair.

source: 就在林立自己都以为，会被那巨大的旋涡所吞没时，一个熟悉的声音却从翡翠高塔内中传来：“马修斯，我看你真是越混越回去了。”
en_us: Just as Lin Li thought he would be swallowed by the giant vortex, a familiar voice rang from within the Emerald Tower. "Matthew, I see you're really getting out of it."

source: 就在此刻，侧门外突然响起一道冷哼声，一道魁梧如巨人般的高大身影大步冲了进来，看到江逸的拳头已经贴近了江如虎的后背，立即大怒道：“小杂碎，敢伤我弟弟？你今日必死无疑。”
en_us: Right at this crucial moment was a cold voice from the side door. A gigantic and stalwart figure dashed in and saw Jiang Yi's fist approaching Jiang Ruhu's back, he shouted furiously, "You brat! How dare you hurt my younger brother? You shall die today for sure."

source: 就在这个时候，楼下却传来了一阵敲门声。
en_us: Just then, there was a knock on the door downstairs.

source: 就在这时，异变突生！
en_us: Just at that moment, an unexpected change suddenly happened!

source: 就在这炼丹师将丹药准备丢进瓷瓶时，他浑浊的眸子突然射出两道精芒，脸色也变得郑重起来，眼睛瞪得大大的，再次仔细观看起丹药来。
en_us: Just when the alchemist was about to throw the pill back into the porcelain bottle, his cloudy eyes suddenly lit up with two bright sparks. His facial expressions also became more solemn. With his eyes opened widely, he once again carefully inspected the elixirs.

source: 就在那一朵朵红莲即将炸开之时，葛瑞安手中法杖一横，也是一阵短暂而急促的吟唱，紧接着翡翠高塔大门外就陡的竖起了一片水蓝色的屏障，那一朵朵红莲落在水幕之上，竟象是石子落入水中一般，只是泛起了一圈圈的涟漪。
en_us: Just as the stalks of red lotus were about to erupt, Gerian held up the staff in his hand, which was followed by a likewise short and rapid recitation of the spell. Almost immediately a water-blue barrier was erected outside the gates of Emerald Tower. The stalks of red lotus fell into the water curtain like stones falling into the water asf ripples appeared on the surface.

source: 就在黑色元力注入丹炉内的那一刻，整个丹炉传来一阵沉闷的炸响，丹炉剧烈摇晃起来，差点翻到在地。、
en_us: At the moment when the black essence force was injected into the cauldron, the entire cauldron released a muffled explosion sound as it shook violently, almost overturning and falling to the ground.

source: 就好象如今的老格林与安度因，大家同样是传奇魔法师，但如果真正打一场的话，老格林却是连一点信心都没有，他毕竟花了太多时间在药剂学上，而安度因虽然也同样沉迷，但他花在魔法技巧上的时间，却远远胜过自己。
en_us: It was like Old Grimm and Andoine at present; they were both legendary mages, but if they were to battle it out, Old Grimm had no confidence at all. After all, he had spent too much time on pharmaceutics. Though Andoine was equally immersed in it, he spent far more time on magic skills compared to Grimm.

source: 就如同大多数野钢花的生长地点一样，洞**阴暗而潮湿，四周的石壁滑得有些腻人，用手摸上去感觉就象在摸一条巨大的蟒蛇，前方一片漆黑，没有一丝光亮透出，林立不得不点起一支火把，凭借着这唯一的光亮往深处摸索着。
en_us: As in most places where the wild steelbloom grew, the cave entrance was dark and damp, the surrounding stone walls so slippery it almost felt like touching a giant python. There was no light in the darkness ahead. Lin Li had no choice but to light a torch and explore the depths of the cave with that single source of light.

source: 就如同眼前的两位大魔导士对决，同为加洛斯城最强大的魔法师，同样是耗尽了最后一丝魔力，甚至老梅林的情况还要比葛瑞安严重一些，他甚至连站都快站不稳了，可在这要命的时候，他却偏偏拿出了一枚强能水晶……
en_us: For example the battle between two archmages right before their eyes. Being the most powerful mages of Jarrosus City, and having exhausted the last of their mana, with Old Merlin's condition worse than Gerian's as he could not even steady himself, it seemed to be over. But right at this crucial point, Old Merlin had taken out the Strong Energy Crystal...

source: 就如麦格雷尼所料一般，任务进行得相当顺利。
en_us: As McGrenn had expected, the quest went smoothly.

source: 就看见双足飞龙俯冲而下，飞溅的酸液洒在树丛当中，刹时间一片青烟直冒，紧接着就是一阵“滋滋滋”的声响此起彼伏，还没等那青烟散尽，郁郁葱葱的树木已是一片枝黄叶落的景象。
en_us: He saw the Wyvern took a dive, splashing acid on the bushes. In an instant, a cloud of green smoke emerged, and a burst of fizzing sounds followed. Before the green smoke could disperse, the scene of lush green trees was transformed into one of fallen branches and yellow leaves.

source: 就算偶尔有那么一两个法术，侥幸穿过巨网拦截，射到了利维坦猩猩身上，也很难造成什么实质性的伤害。
en_us: Even if there were one or two spells that had gotten through the giant web and hit the Leviathan Gorilla, it was difficult to do any real damage to it.

source: 就算是强大的八级魔兽，在这可怕的风刃群面前，也是有些招架不住，一记两记还可以靠着坚韧的皮肤硬抗，可当空中飞舞的风刃达到数十枚之多，量变引起的质变时，利维坦猩猩那坚韧的皮肤就成了一个笑话。
en_us: Even a powerful level-eight magical beast could not withstand the terrifying cluster of wind blades. It could rely on its tough skin to resist a couple of shots, but with dozens of wind blades flying in the air, the quantitative change had led to a qualitative change, and in this case, the Leviathan Gorilla's tough skin had became a joke.

source: 就算是药剂大师林立，在面对这么多草药时，也是忍不住一阵头疼。
en_us: Even Lin Li, a potion master, could not help but have a headache when faced with so many herbs.

source: 就算林立眼睛再瞎，此时恐怕也已经看明白了，这就是安度因曾经提到过的，五级魔兽狮蝎！
en_us: Even if Lin Li was blind, at this moment, it would still have been clear to him as day. It was the Manticore, a level-five demonic beast that Andoine had mentioned!

source: 就算自己不打断马迪亚斯的四肢，他同样可以找其他借口帮儿子报仇，说到底……这里是奥兰纳魔法公会，是奥德文的势力范围，会长大人的儿子想找自己麻烦，实在有太多太多的办法，躲是躲不过去的。
en_us: Even if he had not broken Mathias' arms and legs, he could have similarly found other excuses to help his son take revenge. In the end, this was Alanna Guild of Magic, Odwin's sphere of influence. If the President's son wanted to ask for trouble, there were simply too many ways. He couldn't hide even if he wanted to.

source: 就算这个黄昏诅咒有假，但一旦涉及到了细微之处，却绝骗不过真正的内行，这个年轻法师所说的一些东西，跟当初指点自己的那位药剂师所说一般无二，甚至在某些地方，还比药剂师讲得更加详细，更加清晰名了。
en_us: Even if the Twilight Curse was fake, when it came to the details, he would never deceive a real expert. Some of the things mentioned by this young mage were no different from those mentioned by the pharmacist who had instructed her. It was even more detailed and clearly explained than the pharmacist at some points.

source: 就这么把它放了，林立自然是不甘心的，可顺手杀掉，却又好想有点没意思，想来想去竟弄得林立有些头大，恼火之下怒气自然又撒到了利维坦猩猩头上，这一次也不用什么风刃了，只见这家伙随手扯了一根藤条就开抽，一边抽还一边骂：“让你绑票勒索！让你拿椰子砸老子！让你朝着老子怪笑……对了，刚才老子骂倒哪了？算了，重新骂过……让你绑架勒索……”
en_us: Lin Li was naturally unwilling to let it off this easily. But it'd be meaningless to kill it as well. Lin Li racked his brains over and over, and felt as if his head was about to explode. The anger that stemmed from his frustration was instinctively released on the gorilla, and this time the guy did it without the wind blade. He pulled out a cane and began lashing, cursing as he did it. "This one's for the kidnapping and blackmailing! This one's for smashing me with the coconut! This one's for the queer laughter directed at me! Right... Where was I? Forget it, let's start all over... This one's for the kidnapping and blackmailing...

source: 就这么走了十几分钟，街道上才渐渐热闹起来。
en_us: After walking for over ten minutes, the streets gradually became more lively.

source: 就连宗师药剂师的配方里，也找不到短暂神格药剂的存在，也许神匠级别还有些机会……
en_us: Even in the formulas of pharmacist gurus no traces of the Ephemeral Divinity Potion could be found. Perhaps only someone at the level of a Divine Smith would have it...

source: 就连林立自己，也不由有些惊讶。这股魔法抗性的强大，完全超过了他的估计，通常情况下，要达到如此强大的效果，至少也需要萃取一枚十五级魔晶精华。
en_us: Even Lin Li felt surprised at it. The power of this magic resistance was totally beyond his estimation. Usually, at least a level-fifteen magical crystal essence was needed in order to achieve such a powerful effect.

source: 尸兽们也进攻了，或爬或飞或扑，如蝗虫般密密麻麻朝天庭汹涌而去，疯狂地要摧毁一切，吞噬一切！
en_us: The zombie-beasts attacked—they crawled, flew, or pounced like countless locusts surging forward. They wildly swallowed and destroyed everything in their path!

source: 尽管一夜没睡，但江逸还是精神奕奕，花费了半个时辰他将整本《药草简录》全都背了下来，还对着里面的画像，把药房内的草药都辨认了一遍。
en_us: Even though he had not slept for an entire night, Jiang Yi was still full of energy. He spent an hour memorizing all the information in the "Record on Medicinal Herbs," even identifying the medicinal herbs in the medicine room using the images depicted in the book.

source: 尽管不知道怎么赔？拿什么赔，江逸还是咬牙问道：“怎么个赔法？”
en_us: Even though he had no idea how to repay, or even what to pay with, Jiang Yi nonetheless gritted his teeth and asked, "How do you want me to pay it back?"

source: 尽管从某种意义上说他也顶着一个旁系少爷的名头，但他的实际地位并不比最普通的底层子弟高上多少。尤其是最近几年，因为有名无实的少爷身份，他经常被族内纨绔各种欺辱，每次都受轻重不一的伤。比如这次吧，他就被打得昏迷了整整一个上午。
en_us: if one were to judge solely by his descent, he would be ranked foremost among the branch members. But despite this title, his actual position in the Jiang Clan was not much higher than that of the lowest ranking members of the family. This had rung especially true in the past few years. For him, being “a young master of the Jiang Clan” in name only ensured that he was constantly bullied by other, higher-ranking members of the family. Such torment left him with severe injuries—in this case, for one, he was beaten up so badly that he had spent the entire morning unconscious.

source: 尽管他已是五系宗师，尽管他已经达到了职业的顶峰，但林立心里很清楚，在这顶峰之上，还有虚无缥缈的神匠领域。
en_us: Although he was already a guru of all five series and had already reached the peak of his profession, Lin Li knew very well that there was still the illusory Divine Smith beyond this peak.

source: 尽管他知道姬听雨找他并不是看上他了，尽管马黑旗和柳河也知道姬听雨不会看上他，但他还是感觉事情有些棘手了，红颜祸水！漂亮的女人一些无心之举很容易让爱慕他的男子做出一些冲动的事情。
en_us: Despite knowing that Ji Tingyu's order was by no means out of adoration towards him, and that both Ma Heiqi and Liu He were well aware that she would never fancy him, Jiang Yi nevertheless foresaw trouble. What a femme fatale! The actions of a beautiful woman, however unintentional, would easily send the men who adored her into doing reckless, foolhardy things.
